Soap-requests/7-UpdateSubscriberRequest-request.txt

<se:Envelope xmlns:se="http://schemas.xmlsoap.org/soap/envelope/">
  <se:Body>
    <UpdateSubscriberRequest xmlns="http://broadhop.com/unifiedapi/soap/types">
      <audit>
        <id>username1</id>
        <comment>comment</comment>
      </audit>
         <subscriber>
            <id>001000001bbc5e4a5ca3fb8d</id>
            <credential>
               <networkId>username1</networkId>
            </credential>
            <service>
               <code>Bravo</code>
               <enabled>true</enabled>
            </service>
            <status>INACTIVE</status>
            <billingInfo/>
            <avp>
               <code>UserProfile</code>
               <value>Value2</value>
            </avp>
            <avp>
               <code>Event</code>
               <value>ValueY</value>
            </avp>
            <avp>
               <code>Boost</code>
               <value>False</value>
            </avp>
            <version>2</version>
         </subscriber>

    </UpdateSubscriberRequest>
  </se:Body>
</se:Envelope>